---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.FamilyContainsViewSpecificImports
source: html/f7a2ba82-9924-bb46-3f42-bed1ff81a21f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.FamilyContainsViewSpecificImports Property

Family definition contains view-specific imports. Such imports are inaccessible in the project - consider removal.

## Syntax (C#)
```csharp
public static FailureDefinitionId FamilyContainsViewSpecificImports { get; }
```